<style lang="scss">
h1 {
  margin: 0;
  font-size: 35px;
  font-weight: 800;
}

h2 {
  margin: 0;
  font-size: 30px;
  font-weight: 800;
}

h3 {
  margin: 0;
}

.center_text {
  max-width: 2300px;
  font-weight: 500;

  ul {
    text-align: left;
    padding-left: 25px;
    margin-top: 10px;
  }

  .h3_list {
    margin-top: 25px;
    font-size: 25px;
    font-weight: 600;
  }

  .thick_letters {
    font-weight: 600;
  }
}

.link {
  text-decoration: none;
  color: #404040;
}
</style>

<template>
  <!-- <div id="div_top" style="height: 0px;"></div> -->
  <TransparentBox>
    <h1>
      Создание сайтов и приложений с нуля. Экспертные решения для бизнеса любого масштаба.
    </h1>
  </TransparentBox>
  <TransparentBox>
    <div class="center_text">
      <p style="margin: 0;">
        Ваш бизнес уникален, и его цифровое отражение должно быть таким же. Мы - команда
        <span class="thick_letters">
          Cookiesoft
        </span>
        . Мы не настраиваем
        шаблоны и не ограничиваем вас функционалом готовых CMS. Мы проектируем архитектуру и пишем чистый код, создавая
        индивидуальные сайты, приложения и сложные системы, которые становятся вашим реальным конкурентным
        преимуществом,
        работают на эффективность и масштабируются вместе с вашим ростом.
      </p>
    </div>
  </TransparentBox>
  <TransparentBox>
    <div class="center_text">
      <p style="margin: 0;">
        В мире, где первое впечатление формируется онлайн, а операционная эффективность определяет прибыль, важно иметь
        инструмент, созданный специально для ваших процессов.
        <span class="thick_letters">
          Мы предлагаем не просто услугу, а партнерство в
          разработке,
        </span>
        где каждый этап - от идеи до запуска и поддержки - основан на глубоком анализе ваших задач и технологической
        точности.
      </p>
    </div>
  </TransparentBox>



  <!-- малый бизнес -->
  <ColorBox>
    <TransparentBox>
      <h2>
        Для малого бизнеса и стартапов: Ваш уникальный цифровой старт без компромиссов
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          <span class="thick_letters">
            Вы начинаете свой путь, и каждая деталь работает на ваш имидж и рост.
          </span>
          Сайт на конструкторе - это как визитка из
          дешевой типографии: он выполняет функцию, но не вызывает доверия и не запоминается. Мы верим, что даже на
          старте
          можно и нужно обладать профессиональным цифровым активом.
        </p>
        <h3 class="h3_list">
          Что мы предлагаем:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Эксклюзивные сайты-визитки и лендинги:
            </span>
            Мы создаем не просто страницы, а цельные продукты с продуманным пользовательским путем (user journey).
            Каждый
            элемент - от шрифтов до анимаций - работает на вашу целевую аудиторию, превращая посетителей в клиентов.
          </li>
          <li>
            <span class="thick_letters">
              Минимально жизнеспособные продукты (MVP):
            </span>
            У вас есть инновационная идея? Мы быстро разработаем ее рабочее ядро, чтобы вы могли протестировать гипотезу
            на
            реальном рынке, собрать обратную связь и привлечь первых инвесторов или пользователей без огромных начальных
            вложений.
          </li>
          <li>
            <span class="thick_letters">
              Несложные, но мощные веб-сервисы:
            </span>
            Онлайн-запись, калькулятор услуг, каталог-презентация. Мы реализуем их так, чтобы они были быстрыми,
            удобными
            и
            легко управляемыми вами лично.
          </li>
        </ul>
        <h3 class="h3_list">
          Почему (с нуля) - это выгодно для вас:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Молниеносная скорость:
            </span>
            Сайты без кода от конструкторов часто медленные из-за избыточного кода. Наш чистый, написанный вручную код
            обеспечивает максимальную скорость загрузки, что критично для SEO и удержания внимания пользователя.
          </li>
          <li>
            <span class="thick_letters">
              Абсолютная гибкость:
            </span>
            Захотите добавить нестандартную функцию через год? С индивидуальным кодом это сделать в разы проще и
            дешевле,
            чем переделывать шаблон.
          </li>
          <li>
            <span class="thick_letters">
              Экономия в перспективе:
            </span>
            Вы не платите за ненужные функции и не зависите от ежемесячных плат за конструктор. Ваш сайт - это ваша
            собственность.
          </li>
        </ul>
        <p>
          <span class="thick_letters">
            Идеально для:
          </span>
          частных мастеров, локальных кафе и магазинов, специалистов-фрилансеров, начинающих консультантов,
          технологических стартапов на ранней стадии.
        </p>
        <RouterLink class="link" to="/small-business">
          <SmallBusinessButton>
            Подробнее про разработку малого бизнеса
          </SmallBusinessButton>
        </RouterLink>
      </div>
    </TransparentBox>
  </ColorBox>



  <!-- малый бизнес -->
  <ColorBox>
    <TransparentBox>
      <h2>
        Для среднего бизнеса: Цифровой двигатель роста и автоматизации
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          <span class="thick_letters">
            Ваша компания набрала обороты, и старые инструменты стали тормозить развитие.
          </span>
          Вы переросли визитку, а возможности типовых решений (как WordPress или 1С-Битрикс с шаблонами) исчерпаны — доработки становятся дорогими «костылями». Вам нужна система, которая автоматизирует рутину и открывает новые возможности.
        </p>
        <h3 class="h3_list">
          Что мы предлагаем:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Корпоративные сайты и платформы:
            </span>
            Создаем не просто сайты, а центральные хабы для вашего бизнеса — с каталогами, личными кабинетами клиентов, системами бронирования и сложными фильтрами, которые отражают специфику вашего предложения.
          </li>
          <li>
            <span class="thick_letters">
              Веб-приложения для бизнес-процессов:
            </span>
            Разрабатываем внутренние инструменты для управления проектами, складского учета, работы с клиентской базой или отраслевые B2B-сервисы, которые интегрируются в вашу экосистему.
          </li>
          <li>
            <span class="thick_letters">
              Интеграции как стандарт:
            </span>
            Мы настраиваем двусторонний обмен данными вашего нового сайта с 1С, CRM (AmoCRM, Битрикс24), сервисами эквайринга, телефонии и маркетплейсами, устраняя ручной ввод и человеческий фактор.
          </li>
        </ul>
        <h3 class="h3_list">
          Почему (с нуля) - это стратегия для вас:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Решение точечных задач:
            </span>
            Мы программируем ровно тот функционал, который нужен вашим менеджерам, бухгалтерам или клиентам, без навязанных и лишних модулей.
          </li>
          <li>
            <span class="thick_letters">
              Контроль и безопасность:
            </span>
            Вы знаете, как устроена ваша система. Мы закладываем в архитектуру принципы безопасности с самого начала, что критично при работе с персональными данными клиентов.
          </li>
          <li>
            <span class="thick_letters">
              Масштабируемость:
            </span>
            Завтра вы откроете новый филиал или запустите новую линейку услуг? Архитектура, спроектированная нами, позволит масштабировать систему без болезненных переделок.
          </li>
        </ul>
        <p>
          <span class="thick_letters">
            Идеально для:
          </span>
          производственных компаний, сетевых ритейлеров, дистрибьюторов, учебных центров, развивающихся онлайн-сервисов, медицинских клиник.
        </p>
        <RouterLink class="link" to="/small-business">
          <SmallBusinessButton>
            Подробнее про разработку малого бизнеса
          </SmallBusinessButton>
        </RouterLink>
      </div>
    </TransparentBox>
  </ColorBox>



  <!-- малый бизнес -->
  <ColorBox>
    <TransparentBox>
      <h2>
        Для крупного бизнеса и корпораций: Технологическое партнерство для стратегических задач.
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          <span class="thick_letters">
            Ваши задачи не имеют типовых решений.
          </span>
          Речь идет о создании высоконагруженных, отказоустойчивых систем, которые являются критической инфраструктурой компании. Требуются глубокие интеграции, соответствие стандартам безопасности и архитектура, рассчитанная на годы вперед.
        </p>
        <h3 class="h3_list">
          Что мы предлагаем:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Разработка сложных корпоративных систем:
            </span>
            Портал поставщиков, системы электронного документооборота (СЭД), платформы для управления распределенными активами, аналитические дашборды на больших данных.
          </li>
          <li>
            <span class="thick_letters">
              Создание и оптимизация внутреннего (back-office) ПО:
            </span>
            Узкоспециализированные приложения для инженерного состава, мобильные решения для полевых сотрудников, системы планирования ресурсов предприятия (ERP-модули).
          </li>
          <li>
            <span class="thick_letters">
              Проектирование и развитие цифровых платформ:
            </span>
            Построение экосистемы взаимосвязанных сервисов (например, для клиентов, партнеров и сотрудников) с единой системой идентификации и управления данными.
          </li>
        </ul>
        <h3 class="h3_list">
          Почему (с нуля) - это необходимость для вас:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Стек технологий enterprise-уровня:
            </span>
            Для таких проектов мы применяем проверенные и мощные инструменты: Node.js для высокопроизводительного бэкенда, Vue.js для сложных и отзывчивых интерфейсов, PostgreSQL для надежного хранения и работы с данными, Docker для контейнеризации и простого развертывания в любой инфраструктуре.
          </li>
          <li>
            <span class="thick_letters">
              Архитектурная экспертиза:
            </span>
            Мы проектируем системы на основе микросервисной или грамотной монолитной архитектуры, что обеспечивает стабильность, легкость поддержки и независимое масштабирование компонентов.
          </li>
          <li>
            <span class="thick_letters">
              Полный цикл и документация:
            </span>
            Мы несем ответственность за весь цикл: анализ, проектирование, разработка, тестирование, запуск и техническая поддержка. Предоставляем полную проектно-техническую документацию.
          </li>
        </ul>
        <p>
          <span class="thick_letters">
            Идеально для:
          </span>
          финансовых организаций, промышленных холдингов, федеральных ритейлеров, логистических операторов, государственных и окологосударственных компаний.
        </p>
        <RouterLink class="link" to="/small-business">
          <SmallBusinessButton>
            Подробнее про разработку малого бизнеса
          </SmallBusinessButton>
        </RouterLink>
      </div>
    </TransparentBox>
  </ColorBox>



  <!-- малый бизнес -->
  <ColorBox>
    <TransparentBox>
      <h2>
        Портфолио: Реализованные проекты, где код решал бизнес-задачи
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <h3 class="h3_list">
          Что мы предлагаем:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Разработка сложных корпоративных систем:
            </span>
            Портал поставщиков, системы электронного документооборота (СЭД), платформы для управления распределенными активами, аналитические дашборды на больших данных.
          </li>
          <li>
            <span class="thick_letters">
              Создание и оптимизация внутреннего (back-office) ПО:
            </span>
            Узкоспециализированные приложения для инженерного состава, мобильные решения для полевых сотрудников, системы планирования ресурсов предприятия (ERP-модули).
          </li>
          <li>
            <span class="thick_letters">
              Проектирование и развитие цифровых платформ:
            </span>
            Построение экосистемы взаимосвязанных сервисов (например, для клиентов, партнеров и сотрудников) с единой системой идентификации и управления данными.
          </li>
        </ul>
        
        <p>
          В нашем портфолио вы увидите не скриншоты, а разбор реальных кейсов: какую задачу решал заказчик, какое технологическое решение мы предложили и какой измеримый бизнес-результат был достигнут.
        </p>
        <RouterLink class="link" to="/small-business">
          <SmallBusinessButton>
            Подробнее про разработку малого бизнеса
          </SmallBusinessButton>
        </RouterLink>
      </div>
    </TransparentBox>
  </ColorBox>



  <!-- малый бизнес -->
  <ColorBox>
    <TransparentBox>
      <h2>
        Оставить заявку: Начните диалог с экспертами
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          Мы понимаем, что выбор подрядчика для важного IT-проекта — это серьезное решение. Давайте начнем с открытого диалога.
        </p>
        <h3 class="h3_list">
          Как проходит первый шаг:
        </h3>
        <ol>
          <li>
            Вы оставляете заявку, кратко описав свою задачу или текущую боль.
          </li>
          <li>
            Наш ведущий технический специалист связывается с вами для уточнения деталей.
          </li>
          <li>
            Вы получаете прозрачное предложение с вариантами реализации, оценкой и дорожной картой.
          </li>
          <li>
            В рамках бесплатной консультации мы проводим первичный анализ, определяем возможные подходы к решению и примерные границы проекта.
          </li>
        </ol>
        
        <p>
          Мы не предлагаем шаблонных решений, потому что не верим в их эффективность. Мы предлагаем партнерство, экспертность и код, написанный для вашего успеха.
        </p>
        <RouterLink class="link" to="/small-business">
          <SmallBusinessButton>
            Подробнее про разработку малого бизнеса
          </SmallBusinessButton>
        </RouterLink>
      </div>
    </TransparentBox>
  </ColorBox>


</template>

<script setup lang="ts">
import TransparentBox from "../components/TransparentBox.vue";
import ColorBox from "../components/ColorBox.vue";
import SmallBusinessButton from "../components/SmallBusinessButton.vue";
</script>