<style lang="scss">
h1 {
  margin: 0;
  font-size: 35px;
  font-weight: 800;
}

h2 {
  margin: 0;
  font-size: 30px;
  font-weight: 800;
}

h3 {
  margin: 0;
}

.center_text {
  max-width: 2300px;
  font-weight: 500;

  ul {
    text-align: left;
    padding-left: 25px;
    margin-top: 10px;
  }

  .h3_list {
    margin-top: 25px;
    font-size: 25px;
    font-weight: 600;
  }

  .thick_letters {
    font-weight: 600;
  }
}
</style>

<template>
  <!-- <div id="div_top" style="height: 0px;"></div> -->
  <TransparentBox>
    <h1>
      Индивидуальная разработка сайтов и приложений с нуля. Экспертные решения для бизнеса любого масштаба.
    </h1>
  </TransparentBox>
  <TransparentBox>
    <div class="center_text">
      <p style="margin: 0;">
        Ваш бизнес уникален, и его цифровое отражение должно быть таким же.
        <span class="thick_letters">
          Cookiesoft
        </span>
        - это не агентство с десятками сотрудников. Это персональный сервис эксперта-разработчика полного цикла. Я не
        настраиваю шаблоны и не ограничиваю вас функционалом готовых CMS.
        <span class="thick_letters">
          Я проектирую архитектуру и пишу чистый код,
        </span>
        создавая индивидуальные сайты, приложения и системы, которые становятся вашим реальным конкурентным
        преимуществом, работают на эффективность и масштабируются вместе с вашим ростом.
      </p>
    </div>
  </TransparentBox>
  <TransparentBox>
    <div class="center_text">
      <p style="margin: 0;">
        В мире, где первое впечатление формируется онлайн, а операционная эффективность определяет прибыль, важно иметь
        инструмент, созданный специально для ваших процессов. Я предлагаю не просто услугу, а
        <span class="thick_letters">
          партнерство в разработке,
        </span>
        где каждый этап - от идеи до запуска и поддержки - основан на глубоком анализе ваших задач, технологической
        точности и моей
        <span class="thick_letters">
          личной ответственности
        </span>
        за результат. Вы получаете прямое общение с архитектором и исполнителем в одном лице, без потерь на коммуникацию
        внутри команды.
      </p>
    </div>
  </TransparentBox>



  <!-- малый бизнес -->
  <ColorBox :num_id="1">
    <TransparentBox>
      <h2>
        Для малого бизнеса и стартапов: Ваш уникальный цифровой старт без компромиссов
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          <span class="thick_letters">
            Вы начинаете свой путь, и каждая деталь работает на ваш имидж и рост.
          </span>
          Сайт на конструкторе - это как визитка из дешевой типографии: он выполняет функцию, но не вызывает доверия и
          не запоминается. Я верю, что даже на старте можно и нужно обладать профессиональным цифровым активом,
          созданным специально для вас.
        </p>
        <h3 class="h3_list">
          Что я предлагаю:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Эксклюзивные сайты-визитки и лендинги:
            </span>
            Я создаю не просто страницы, а цельные продукты с продуманным пользовательским путем (user journey). Каждый
            элемент - от шрифтов до анимаций - работает на вашу целевую аудиторию, превращая посетителей в клиентов.
          </li>
          <li>
            <span class="thick_letters">
              Минимально жизнеспособные продукты (MVP):
            </span>
            У вас есть инновационная идея? Я быстро разработаю ее рабочее ядро, чтобы вы могли протестировать гипотезу
            на реальном рынке, собрать обратную связь и привлечь первых инвесторов или пользователей без огромных
            начальных вложений.
          </li>
          <li>
            <span class="thick_letters">
              Несложные, но мощные веб-сервисы:
            </span>
            Онлайн-запись, калькулятор услуг, каталог-презентация. Я реализую их так, чтобы они были быстрыми, удобными
            и легко управляемыми вами лично.
          </li>
        </ul>
        <h3 class="h3_list">
          Почему (с нуля) - это выгодно для вас:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Молниеносная скорость и контроль:
            </span>
            Сайты без кода от конструкторов часто медленные из-за избыточного кода. Мой чистый, написанный вручную код
            обеспечивает максимальную скорость загрузки, что критично для SEO. Вы общаетесь напрямую с создателем,
            поэтому любые изменения вносятся точно и осмысленно.
          </li>
          <li>
            <span class="thick_letters">
              Абсолютная гибкость и право собственности:
            </span>
            Захотите добавить нестандартную функцию через год? С индивидуальным кодом это сделать в разы проще. Вы
            являетесь полным владельцем продукта и не зависите от ежемесячных плат за конструктор.
          </li>
          <li>
            <span class="thick_letters">
              Экономия без посредников:
            </span>
            Работая напрямую со мной, вы не оплачиваете накладные расходы агентства. Моя ставка - это инвестиция в
            качественный код и личную ответственность за ваш проект.
          </li>
        </ul>
        <p>
          <span class="thick_letters">
            Идеально для:
          </span>
          частных мастеров, локальных кафе и магазинов, специалистов-фрилансеров, начинающих консультантов,
          технологических стартапов на ранней стадии.
        </p>

        <SmallBusinessButton>
          Подробнее про разработку малого бизнеса
        </SmallBusinessButton>
      </div>
    </TransparentBox>
  </ColorBox>



  <!-- средний бизнес -->
  <ColorBox :num_id="2">
    <TransparentBox>
      <h2>
        Для среднего бизнеса: Цифровой двигатель роста и автоматизации
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          <span class="thick_letters">
            Ваша компания набрала обороты, и старые инструменты стали тормозить развитие.
          </span>
          Вы переросли визитку, а возможности типовых решений (как WordPress или 1С-Битрикс с шаблонами) исчерпаны -
          доработки становятся дорогими «костылями». Вам нужна система, которая автоматизирует рутину и открывает новые
          возможности, созданная с пониманием вашей специфики.
        </p>
        <h3 class="h3_list">
          Что я предлагаю:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Корпоративные сайты и платформы:
            </span>
            Создаем не просто сайты, а центральные хабы для вашего бизнеса - с каталогами, личными кабинетами клиентов,
            системами бронирования и сложными фильтрами, которые отражают специфику вашего предложения.
          </li>
          <li>
            <span class="thick_letters">
              Веб-приложения для бизнес-процессов:
            </span>
            Я разрабатываю внутренние инструменты для управления проектами, складского учета, работы с клиентской базой
            или отраслевые B2B-сервисы, которые интегрируются в вашу экосистему.
          </li>
          <li>
            <span class="thick_letters">
              Интеграции как стандарт:
            </span>
            Я настраиваю двусторонний обмен данными вашего нового сайта с 1С, CRM (AmoCRM, Битрикс24), сервисами
            эквайринга, телефонии и маркетплейсами, устраняя ручной ввод и человеческий фактор.
          </li>
        </ul>
        <h3 class="h3_list">
          Почему работа с одним экспертом - это стратегия для вас:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Глубина погружения и последовательность:
            </span>
            Весь проект от начала и до конца ведет один специалист. Я глубоко погружаюсь в ваши бизнес-процессы, что
            обеспечивает целостность архитектуры и отсутствие «разрывов» в логике, которые часто возникают при работе
            команды.
          </li>
          <li>
            <span class="thick_letters">
              Решение точечных задач и безопасность:
            </span>
            Я программирую ровно тот функционал, который нужен вашим менеджерам, бухгалтерам или клиентам, без
            навязанных модулей. Безопасность и надежность закладываются в основу системы с первого дня.
          </li>
          <li>
            <span class="thick_letters">
              Прямая коммуникация и скорость решений:
            </span>
            Все решения принимаются быстро, без внутренних согласований. Вы всегда в курсе статуса проекта, потому что
            общаетесь непосредственно с исполнителем.
          </li>
        </ul>
        <p>
          <span class="thick_letters">
            Идеально для:
          </span>
          производственных компаний, сетевых ритейлеров, дистрибьюторов, учебных центров, развивающихся онлайн-сервисов,
          медицинских клиник.
        </p>
        <MediumBusinessButton>
          Подробнее про разработку малого бизнеса
        </MediumBusinessButton>
      </div>
    </TransparentBox>
  </ColorBox>



  <!-- крупный бизнес -->
  <ColorBox :num_id="3">
    <TransparentBox>
      <h2>
        Для крупного бизнеса и корпораций: Технологическое партнерство с экспертом для стратегических задач.
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          <span class="thick_letters">
            Ваши задачи не имеют типовых решений.
          </span>
          Речь идет о создании высоконагруженных, отказоустойчивых систем, которые являются критической инфраструктурой
          компании. Требуются глубокие интеграции, соответствие стандартам безопасности и архитектура, рассчитанная на
          годы вперед. Для таких проектов я привлекаю всю свою экспертизу и работаю с технологиями enterprise-уровня.
        </p>
        <h3 class="h3_list">
          Что я предлагаю:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Разработка сложных корпоративных систем и модулей:
            </span>
            Портал поставщиков, системы электронного документооборота (СЭД), аналитические дашборды, отдельные модули
            для ERP-систем (например, управление закупками или персоналом).
          </li>
          <li>
            <span class="thick_letters">
              Создание и оптимизация внутреннего (back-office) ПО
            </span>
            Узкоспециализированные приложения для инженерного состава, системы планирования ресурсов, инструменты для
            аналитики больших данных.
          </li>
          <li>
            <span class="thick_letters">
              Технический аудит и доработка существующих систем:
            </span>
            Независимый взгляд на архитектуру, оптимизация производительности, рефакторинг кода для снижения затрат на
            поддержку.
          </li>
        </ul>
        <h3 class="h3_list">
          Почему (с нуля) - это необходимость для вас:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Фокус и персональная ответственность:
            </span>
            Ваш проект получает 100% моего внимания и профессионализма. Ответственность за результат четко определена и
            лежит на мне.
          </li>
          <li>
            <span class="thick_letters">
              Стек технологий enterprise-уровня и архитектурная экспертиза:
            </span>
            Для таких проектов я применяю проверенные и мощные инструменты: Node.js для высокопроизводительного бэкенда,
            Vue.js для сложных и отзывчивых интерфейсов, PostgreSQL для надежного хранения данных, Docker для
            контейнеризации. Я проектирую системы на основе микросервисной или грамотной монолитной архитектуры для
            обеспечения стабильности и масштабируемости.
          </li>
          <li>
            <span class="thick_letters">
              Прямой доступ к компетенциям и гибкость:
            </span>
            Вы получаете доступ к эксперту, который обычно работает в роли технического директора или ведущего
            архитектора. Это позволяет гибко формировать scope проекта, начиная с критически важного MVP и
            последовательно его наращивая.
          </li>
        </ul>
        <p>
          <span class="thick_letters">
            Идеально для:
          </span>
          технологических департаментов крупных компаний, нуждающихся в точечной экспертизе, для запуска пилотных
          IT-проектов, для доработки и оптимизации существующих систем, где требуется глубокое погружение.
        </p>
        <BigBusinessButton>
          Подробнее про разработку малого бизнеса
        </BigBusinessButton>
      </div>
    </TransparentBox>
  </ColorBox>



  <!-- малый бизнес -->
  <ColorBox>
    <TransparentBox>
      <h2>
        Портфолио: Реализованные проекты, где код решал бизнес-задачи
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          Моя лучшая презентация - это работа, которую я уже сделал. В каждом проекте я не просто следовал техническому
          заданию, а искал оптимальный путь достижения бизнес-цели заказчика. Я лично отвечал за архитектуру, код и
          результат.
        </p>
        <h3 class="h3_list">
          Примеры моих работ:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Разработка сложных корпоративных систем:
            </span>
            Портал поставщиков, системы электронного документооборота (СЭД), платформы для управления распределенными
            активами, аналитические дашборды на больших данных.
          </li>
          <li>
            <span class="thick_letters">
              Создание и оптимизация внутреннего (back-office) ПО:
            </span>
            Узкоспециализированные приложения для инженерного состава, мобильные решения для полевых сотрудников,
            системы планирования ресурсов предприятия (ERP-модули).
          </li>
          <li>
            <span class="thick_letters">
              Проектирование и развитие цифровых платформ:
            </span>
            Построение экосистемы взаимосвязанных сервисов (например, для клиентов, партнеров и сотрудников) с единой
            системой идентификации и управления данными.
          </li>
        </ul>

        <p>
          В моем портфолио вы увидите разбор реальных кейсов: какую задачу решал заказчик, какое технологическое решение
          я предложил и какой измеримый бизнес-результат был достигнут.
        </p>
        <PortfolioButton>
          Подробнее про разработку малого бизнеса
        </PortfolioButton>
      </div>
    </TransparentBox>
  </ColorBox>



  <!-- малый бизнес -->
  <ColorBox>
    <TransparentBox>
      <h2>
        Оставить заявку: Начните диалог напрямую с разработчиком
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          Выбор подрядчика для важного IT-проекта - это серьезное решение, основанное на доверии и компетенции. Давайте
          начнем с открытого диалога, где вы будете общаться непосредственно с тем, кто будет решать вашу задачу.
        </p>
        <h3 class="h3_list">
          Как проходит первый шаг:
        </h3>
        <ol>
          <li>
            Вы оставляете заявку, кратко описав свою задачу или текущую боль.
          </li>
          <li>
            Я лично связываюсь с вами для уточнения деталей и первичного анализа.
          </li>
          <li>
            В рамках бесплатной консультации мы обсуждаем возможные подходы, технологический стек и примерные границы
            проекта.
          </li>
          <li>
            Вы получаете прозрачное коммерческое предложение от исполнителя, с четкой оценкой, этапами и моей личной
            ответственностью за каждый из них.
          </li>
        </ol>

        <p>
          Я не предлагаю шаблонных решений, потому что не верю в их эффективность. Я предлагаю партнерство, свою
          экспертность и код, написанный для вашего успеха.
        </p>
        <SmallBusinessButton>
          Подробнее про разработку малого бизнеса
        </SmallBusinessButton>
      </div>
    </TransparentBox>
  </ColorBox>


</template>

<script setup lang="ts">
import TransparentBox from "../components/TransparentBox.vue";
import ColorBox from "../components/ColorBox.vue";
import SmallBusinessButton from "../components/SmallBusinessButton.vue";
import MediumBusinessButton from "../components/MediumBusinessButton.vue";
import BigBusinessButton from "../components/BigBusinessButton.vue";
import PortfolioButton from "../components/PortfolioButton.vue";
</script>