<style lang="scss">
h1 {
  margin: 0;
  font-size: 35px;
  font-weight: 800;
}

h2 {
  margin: 0;
  font-size: 30px;
  font-weight: 800;
}

h3 {
  margin: 0;
}

.center_text {
  max-width: 2300px;
  font-weight: 500;

  ul {
    text-align: left;
    padding-left: 25px;
    margin-top: 10px;
  }

  .h3_list {
    margin-top: 25px;
    font-size: 25px;
    font-weight: 600;
  }

  .thick_letters {
    font-weight: 600;
  }
}

.link {
  text-decoration: none;
  color: #404040;
}
</style>

<template>
  <!-- <div id="div_top" style="height: 0px;"></div> -->
  <TransparentBox>
    <h1>
      Создание сайтов и приложений с нуля. Экспертные решения для бизнеса любого масштаба.
    </h1>
  </TransparentBox>
  <TransparentBox>
    <div class="center_text">
      <p style="margin: 0;">
        Ваш бизнес уникален, и его цифровое отражение должно быть таким же. Мы - команда
        <span class="thick_letters">
          Cookiesoft
        </span>
        . Мы не настраиваем
        шаблоны и не ограничиваем вас функционалом готовых CMS. Мы проектируем архитектуру и пишем чистый код, создавая
        индивидуальные сайты, приложения и сложные системы, которые становятся вашим реальным конкурентным
        преимуществом,
        работают на эффективность и масштабируются вместе с вашим ростом.
      </p>
    </div>
  </TransparentBox>
  <TransparentBox>
    <div class="center_text">
      <p style="margin: 0;">
        В мире, где первое впечатление формируется онлайн, а операционная эффективность определяет прибыль, важно иметь
        инструмент, созданный специально для ваших процессов.
        <span class="thick_letters">
          Мы предлагаем не просто услугу, а партнерство в
          разработке,
        </span>
        где каждый этап - от идеи до запуска и поддержки - основан на глубоком анализе ваших задач и технологической
        точности.
      </p>
    </div>
  </TransparentBox>

  <ColorBox>
    <TransparentBox>
      <h2>
        Для малого бизнеса и стартапов: Ваш уникальный цифровой старт без компромиссов
      </h2>
    </TransparentBox>
    <TransparentBox>
      <div class="center_text">
        <p>
          <span class="thick_letters">
            Вы начинаете свой путь, и каждая деталь работает на ваш имидж и рост.
          </span>
          Сайт на конструкторе - это как визитка из
          дешевой типографии: он выполняет функцию, но не вызывает доверия и не запоминается. Мы верим, что даже на
          старте
          можно и нужно обладать профессиональным цифровым активом.
        </p>
        <h3 class="h3_list">
          Что мы предлагаем:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Эксклюзивные сайты-визитки и лендинги:
            </span>
            Мы создаем не просто страницы, а цельные продукты с продуманным пользовательским путем (user journey).
            Каждый
            элемент - от шрифтов до анимаций - работает на вашу целевую аудиторию, превращая посетителей в клиентов.
          </li>
          <li>
            <span class="thick_letters">
              Минимально жизнеспособные продукты (MVP):
            </span>
            У вас есть инновационная идея? Мы быстро разработаем ее рабочее ядро, чтобы вы могли протестировать гипотезу
            на
            реальном рынке, собрать обратную связь и привлечь первых инвесторов или пользователей без огромных начальных
            вложений.
          </li>
          <li>
            <span class="thick_letters">
              Несложные, но мощные веб-сервисы:
            </span>
            Онлайн-запись, калькулятор услуг, каталог-презентация. Мы реализуем их так, чтобы они были быстрыми,
            удобными
            и
            легко управляемыми вами лично.
          </li>
        </ul>

        <h3 class="h3_list">
          Почему (с нуля) - это выгодно для вас:
        </h3>
        <ul>
          <li>
            <span class="thick_letters">
              Молниеносная скорость:
            </span>
            Сайты без кода от конструкторов часто медленные из-за избыточного кода. Наш чистый, написанный вручную код
            обеспечивает максимальную скорость загрузки, что критично для SEO и удержания внимания пользователя.
          </li>
          <li>
            <span class="thick_letters">
              Абсолютная гибкость:
            </span>
            Захотите добавить нестандартную функцию через год? С индивидуальным кодом это сделать в разы проще и
            дешевле,
            чем переделывать шаблон.
          </li>
          <li>
            <span class="thick_letters">
              Экономия в перспективе:
            </span>
            Вы не платите за ненужные функции и не зависите от ежемесячных плат за конструктор. Ваш сайт - это ваша
            собственность.
          </li>
        </ul>

        <p>
          <span class="thick_letters">
            Идеально для:
          </span>
          частных мастеров, локальных кафе и магазинов, специалистов-фрилансеров, начинающих консультантов,
          технологических стартапов на ранней стадии.
        </p>
      </div>
    </TransparentBox>

    <RouterLink class="link" to="/small-business">
      <SmallBusinessButton>
        Подробнее про разработку малого бизнеса
      </SmallBusinessButton>
    </RouterLink>
  </ColorBox>


</template>

<script setup lang="ts">
import TransparentBox from "../components/TransparentBox.vue";
import ColorBox from "../components/ColorBox.vue";
import SmallBusinessButton from "../components/SmallBusinessButton.vue";
</script>