<style scoped lang="scss">
.black_block {
    grid-template-columns: auto !important;

    .h3X {
        grid-column: 1 span !important;
    }

}

@media screen and (max-width:900px) {
    .all_lists {
        grid-template-columns: auto !important;

        .black_block {
            grid-column: 1 span !important;
        }

        .div_list {
            grid-column: 1 span !important;
        }
    }
}
</style>
<template>
    <TransparentBox>
        <h2>
            Портал для поставщиков
        </h2>
    </TransparentBox>
    <TransparentBox>
        <div class="center_text">
            <p>
                Закрытая или открытая веб-система, через которую ваши поставщики (контрагенты, подрядчики, дилеры)
                взаимодействуют с вашей компанией: видят текущие закупки, оставляют коммерческие предложения, загружают
                документы, получают уведомления о тендерах и согласовывают поставки. Это ваш цифровой мост с теми, кто
                поставляет вам товары или услуги.


            </p>
            <p>
                Кому подходит: Производственные компании, дистрибьюторы, сети розничной торговли, строительные холдинги,
                логистические операторы, компании с регулярными закупками у внешних поставщиков (от 20+ контрагентов).
            </p>
            <div class="all_lists">
                <div class="black_block">
                    <div class="div_list">
                        <h3 class="h3X">
                            Что входит в решение:
                        </h3>
                        <ul>
                            <li>
                                <span class="bold_text">
                                    Реестр поставщиков
                                </span>
                                — список всех контрагентов с контактами, статусами, рейтингом
                            </li>

                            <li>
                                <span class="bold_text">
                                    Личный кабинет поставщика
                                </span>
                                — вход по логину/паролю, профиль компании, документы
                            </li>

                            <li>
                                <span class="bold_text">
                                    Модуль тендеров и закупок
                                </span>
                                — создание закупочных процедур, публикация для поставщиков
                            </li>

                            <li>
                                <span class="bold_text">
                                    Подача коммерческих предложений
                                </span>
                                — поставщик видит потребность и отправляет свое предложение
                                с ценой и сроками
                            </li>

                            <li>
                                <span class="bold_text">
                                    Сравнение предложений
                                </span>
                                — вы как заказчик видите все оферты в одной таблице
                            </li>

                            <li>
                                <span class="bold_text">
                                    Загрузка документов
                                </span>
                                — счета, договоры, сертификаты, УПД (с автоматическим уведомлением)
                            </li>

                            <li>
                                <span class="bold_text">
                                    Статусы поставок
                                </span>
                                — поставщик отмечает этапы: «в работе», «отгружено», «доставлено»
                            </li>

                            <li>
                                <span class="bold_text">
                                    Уведомления
                                </span>
                                — email и/или Telegram при новых закупках, изменении статуса, одобрении заявки
                            </li>

                            <li>
                                <span class="bold_text">
                                    Архив закупок и договоров
                                </span>
                                — все закрытые сделки хранятся с возможностью поиска
                            </li>

                            <li>
                                <span class="bold_text">
                                    Ролевая модель
                                </span>
                                — администратор портала, менеджер по закупкам, бухгалтер (просмотр),
                                поставщик (ограниченный доступ)1
                            </li>
                        </ul>
                    </div>
                </div>
                <div class="div_list">
                    <h3>
                        Что вы получаете как бизнес:
                    </h3>
                    <ul>
                        <li>

                            Прозрачность закупок — все предложения в одном месте, ничего не теряется в почте
                        </li>

                        <li>

                            Скорость согласования — поставщики сами отслеживают новые закупки, вы не тратите время на
                            обзвон
                        </li>

                        <li>

                            Снижение ручной работы — документы загружаются и хранятся в системе, не нужно пересылать по
                            email
                        </li>

                        <li>

                            Контроль качества — вы видите историю работы с каждым поставщиком
                        </li>

                        <li>

                            Масштабируемость — система работает с 10 поставщиками и с 500+ одинаково хорошо
                        </li>
                    </ul>
                </div>
                <div class="div_list">
                    <h3>
                        Примеры использования:
                    </h3>
                    <ul>
                        <li>

                            Производство мебели: портал для поставщиков фурнитуры, ДСП, кромки — заявки на отгрузку,
                            загрузка сертификатов
                        </li>
                        
                        <li>

                            Сеть АЗС: портал для поставщиков топлива — тендеры на партии, загрузка паспортов качества
                        </li>
                            
                        <li>

                            Дистрибьютор продуктов: поставщики (фермеры, производители) загружают предложения по сезонным
                            позициям
                        </li>
                        
                        <li>

                            Строительная компания: субподрядчики подают сметы и графики работ, загружают акты КС-2
                        </li>
                        </ul>
                </div>
                <!-- <div class="div_list">
                    <h3>
                        Почему стоит заказать у меня, а не на конструкторе:
                    </h3>
                    <ul>
                        <li></li>
                        Почему заказать у меня, а не покупать готовый модуль к 1С или Битрикс:

Готовые решения часто перегружены ненужным функционалом — я делаю ровно то, что нужно вам

Интеграция с вашей бухгалтерской системой (1С, SAP) настраивается под ваш формат обмена

Вы не платите за лишние лицензии и ежегодные продления

Интерфейс проектируется под ваших поставщиков — простой и понятный, без обучения
                    </ul>
                </div> -->
            </div>
            <div class="price_center">
                от 450 000 ₽
            </div>
        </div>
    </TransparentBox>
</template>
<script setup lang="ts">
import TransparentBox from "../TransparentBox.vue";
</script>