<style scoped lang="scss">
.div_list {
    grid-column: 2 span !important;
}

#n_list1 {
    grid-column: 1 span !important;
    grid-row: 2 span;
}

.all_lists {
    // grid-template-columns: auto auto auto !important;
    grid-template-columns: 35% 20% 45% !important;
}

@media screen and (max-width:900px) {
    .all_lists {
        grid-template-columns: auto !important;
    }

    #n_list1 {
        grid-column: 1 span !important;
    }

    .div_list {
        grid-column: 1 span !important;
    }
}
</style>
<template>
    <TransparentBox>
        <h2>
            Простой личный кабинет (история заказов, профиль)
        </h2>
    </TransparentBox>
    <TransparentBox>
        <div class="center_text">
            <p>
                Защищенный раздел на вашем сайте, где клиент может авторизоваться, просматривать свои данные,
                отслеживать историю заказов или обращений и управлять базовой информацией о себе. Это первый шаг к
                построению долгосрочных отношений с клиентом и повышению лояльности.
            </p>
            <p>
                Кому подходит: Интернет-магазины (начальный уровень), сервисные центры, клиники, салоны красоты,
                онлайн-школы, доставки, службы такси, стартапы с регулярными клиентами.
            </p>
            <div class="all_lists">
                <div class="div_list" id="n_list1">
                    <h3>
                        Что входит в решение:
                    </h3>
                    <ul>
                        <li>

                            Регистрация и вход по email / телефону и паролю
                        </li>

                        <li>

                            Восстановление пароля через email
                        </li>

                        <li>

                            Страница профиля (ФИО, телефон, email, адрес доставки)
                        </li>

                        <li>

                            Возможность редактировать личные данные
                        </li>

                        <li>

                            История заказов или обращений (дата, статус, сумма)
                        </li>

                        <li>

                            Просмотр деталей конкретного заказа
                        </li>

                        <li>

                            Простая админ-панель для управления пользователями (список, блокировка, удаление)
                        </li>

                        <li>

                            Защита паролей (хэширование) и базовая защита от подбора
                        </li>
                    </ul>
                </div>
                <div class="div_list">
                    <h3>
                        Что вы получаете как владелец:
                    </h3>
                    <ul>
                        <li>

                            Клиенты возвращаются к вам, а не теряют историю
                        </li>

                        <li>

                            Вы видите, кто и что заказывал — можно анализировать
                        </li>

                        <li>

                            Уменьшается нагрузка на поддержку (клиент сам смотрит статус)
                        </li>

                        <li>

                            База для будущего расширения (скидки, бонусы, избранное)
                        </li>
                    </ul>
                </div>
                <div class="div_list">
                    <h3>
                        Примеры использования:
                    </h3>
                    <ul>
                        <li>

                            Интернет-магазин свечей: клиент заходит, видит свои прошлые заказы и их статус (собран /
                            отправлен / доставлен)
                        </li>

                        <li>

                            Салон красоты: клиент видит историю визитов, записанные процедуры, мастера
                        </li>

                        <li>

                            Онлайн-школа: ученик видит купленные курсы и прогресс
                        </li>

                        <li>

                            Сервис доставки еды: клиент видит прошлые заказы и может повторить заказ в один клик
                        </li>
                    </ul>
                </div>
                <!-- <div class="div_list">
                    <h3>
                        Почему стоит заказать у меня, а не на конструкторе:
                    </h3>
                    <ul>
                        <li></li>
                        Почему стоит заказать у меня, а не готовый модуль на CMS:

Готовые модули часто перегружены ненужными кнопками и полями

Я делаю ровно то, что нужно вам: без лишних вкладок и сложностей

Простой кабинет = быстрый кабинет (не тормозит)

Легко доработать позже: добавить бонусы, историю просмотров, избранное
                    </ul>
                </div> -->
            </div>
            <div class="price_center">
                <!-- от 100 000 ₽ -->
                от 50 000 ₽
            </div>
        </div>
    </TransparentBox>
</template>
<script setup lang="ts">
import TransparentBox from "../TransparentBox.vue";
</script>